tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "rusty-ferris-club/tap"

# Text editors
brew "ctags-exuberant"
brew "markdown"
brew "vim"

# Terminal Tools
brew "ack"
brew "amazon-ecs-cli"
brew "awscli"
cask "aws-vault"
brew "coreutils"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "gpg"
brew "gron"
brew "hub"
brew "jq"
brew "nmap"
brew "proctools"
brew "reattach-to-user-namespace"
brew "shellclear"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "wget"
brew "xz"
brew "zlib'

# Application Dependencies
brew "autoconf"
brew "automake"
brew "awslogs"
brew "binutils"
brew "bison"
brew "chruby"
brew "gcc"
brew "gdbm"
brew "imagemagick"
brew "libffi"
brew "libksba"
brew "libyaml"
brew "make"
brew "memcached"
brew "openssl@1.1"
brew "openssl@3"
brew "python@3.11"
brew "readline"
brew "redis"
brew "ruby-install"

# Hashicorp Tools
brew "consul"
brew "nomad"
brew "packer"
brew "vault"
brew "tfenv"
brew "tflint"
brew "tfsec"
brew "terraform-docs"

# Databases
brew "mysql@5.7"
brew "postgresql"

# Javascript
brew "nvm"
brew "yarn"
